tap "ankitpokhrel/jira-cli"
tap "facebook/fb"
tap "gigalixir/brew"
tap "hashicorp/tap"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "jesseduffield/lazygit"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "pulumi/tap"
tap "romkatv/powerlevel10k"

brew "git"
brew "asdf"
brew "openssl@3"
brew "awscli"
brew "bat"
brew "boost"
brew "glib"
brew "carapace"
brew "circleci"
brew "cocoapods"
brew "curl"
brew "deno"
brew "displayplacer"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "elixir"
brew "exiftool"
brew "eza"
brew "fd"
brew "harfbuzz"
brew "pango"
brew "ffmpeg"
brew "flyctl"
brew "fx"
brew "fzf"
brew "gcc"
brew "gdrive"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "git-flow"
brew "git-lfs"
brew "gobject-introspection"
brew "jasper"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "grepcidr"
brew "imagemagick"
brew "ios-deploy"
brew "jq"
brew "krb5"
brew "lastpass-cli"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "nghttp2"
brew "ni"
brew "nikto"
brew "ollama", restart_service: :changed
brew "pandoc"
brew "parallel"
brew "pngpaste"
brew "postgresql@14"
brew "pyenv"
brew "python@3.11"
brew "python@3.9"
brew "qpdf"
brew "repomix"
brew "ripgrep"
brew "scrcpy"
brew "starship"
brew "tmux"
brew "trivy"
brew "watchman"
brew "yarn"
brew "zoxide"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "facebook/fb/idb-companion"
brew "gigalixir/brew/gigalixir"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
brew "pulumi/tap/pulumi"

cask "docker-desktop"
cask "espanso"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "ghostty"
cask "mitmproxy"
cask "ngrok"
cask "raycast"
cask "rectangle"
cask "temurin"
cask "vlc"
cask "zulu17"