tap "facebook/fb"
tap "gigalixir/brew"
tap "hashicorp/tap"
tap "oven-sh/bun"
tap "anomalyco/tap"

# core tools
brew "git"
brew "neovim"
brew "tmux"
brew "stow"
brew "starship"
brew "zoxide"
brew "fzf"

# cli nice-to-have
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "jq"
brew "lazygit"
brew "lazydocker"
brew "yazi"
brew "git-delta"
brew "git-lfs"
brew "btop"

# dev tools
brew "gh"
brew "deno"
brew "oven-sh/bun/bun"
brew "ni"
brew "hashicorp/tap/terraform"
brew "repomix"
brew "anomalyco/tap/opencode"

# elixir
brew "elixir"
brew "gigalixir/brew/gigalixir"

# react native / ios
brew "ios-deploy"
brew "watchman"
brew "facebook/fb/idb-companion"

# python lsp
brew "basedpyright"
brew "ruff"

# treesitter parser compilation
brew "tree-sitter"

# version manager (node, ruby, python, java)
brew "mise"
brew "uv"

# ruby build deps (mise compiles from source)
brew "libyaml"
brew "openssl@3"
brew "readline"
brew "gmp"

# cloud / infra
brew "awscli"
brew "gdrive"

# media / pdf
brew "exiftool"
brew "imagemagick"
brew "pandoc"
brew "qpdf"
brew "ghostscript"
brew "poppler"
brew "pngpaste"
brew "resvg"
brew "sevenzip"
brew "spotify_player"

# utils
brew "parallel"
brew "npq"
brew "scrcpy"
brew "rtk"

cask "coconutbattery"
cask "font-jetbrains-mono-nerd-font"
cask "orbstack"
cask "pearcleaner"
cask "raycast"
cask "rectangle"
cask "vlc"
cask "whatsapp"
