# core tools
brew "git"
brew "neovim"
brew "tmux"
brew "stow"
brew "starship"
brew "zoxide"
brew "fzf"

# cli nice-to-have
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "jq"
brew "lazygit"
brew "lazydocker"
brew "git-delta"
brew "git-lfs"
brew "btop"
brew "tree"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "tlrc"
brew "hunk"

# dev tools
brew "colima"
brew "docker"
brew "docker-compose"
brew "gh"
brew "kubectl"
brew "ni"
brew "opencode"
brew "elixir"
brew "awscli"

# version manager (node, ruby, python, java)
brew "mise"
brew "uv"

# utils
brew "npq"
brew "rtk"

cask "bruno"
cask "coconutbattery"
cask "codex"
cask "font-jetbrains-mono-nerd-font"
cask "karabiner-elements"
cask "keycastr"
cask "pearcleaner"
cask "raycast"
cask "rectangle"
cask "vlc"
cask "whatsapp"
cask "zed"
